---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.OverlapFailures.AreaBoundaryLinesOverlap
source: html/49b8388d-a045-48d8-3cc0-899d75dfb754.htm
---
# Autodesk.Revit.DB.BuiltInFailures.OverlapFailures.AreaBoundaryLinesOverlap Property

Highlighted area boundary lines overlap. Color fills, area tags, and areas may not behave correctly.

## Syntax (C#)
```csharp
public static FailureDefinitionId AreaBoundaryLinesOverlap { get; }
```